"use strict";

//22. ստեղծում ենք փոփոխական, որի մեջ ստեղծում եք սթրինգ 500 բառից բաղկացած պատմություն,
//   ու էդ սթրիգի մեջ օգտագործում եք ${} սրանցից  ու մեջը գրում եք տարատեսակ JS կոդեր, 
//  որոնք կարող են ձեր պատմության հետ կապ ունենալ, օրինակ (տարեթվեր, անուններ և այլն)

// const myEjmiatsin = {
//     churchs: [{
//             church1: "Մայր աթոռ սուրբ Էջմիածին"
//         },
//         {
//             church2: "Սուրբ Հռիփսիմե եկեղեցի"
//         },
//         {
//             church3: "Սուրբ Գայանե եկեղեցի"
//         },
//         {
//             church4: "Սուրբ Շողակաթ եկեղեցի"
//         },
//         {
//             church5: "Սուրբ Մարիամ Աստվածածին"
//         },
//     ],
//     cityNames: [{
//             name1: "Էջմիածին"
//         },
//         {
//             name2: "Վարդգեսավան"
//         },
//         {
//             name3: "Արտիմեդ"
//         }
//     ],
//     aboutEjmiatsin() {
//         return `
//     Վաղարշապատ (առավել հայտնի է ${myEjmiatsin.cityNames[0].name1} անվանումով), քաղաք Հայաստանի Արմավիրի մարզում։ Հայաստանի քաղաքներից մեծությամբ չորրորդն է։
//     Վաղարշապատում կա 5 եկեղեցի, որոնցից մեկը՝ ${myEjmiatsin.churchs[0].church1}, Հայաստանի գլխավոր եկեղեցին է և գտնվում է Մայր Աթոռ Սուրբ Էջմիածնի համալիրի մեջ,
//     որը Հայ Առաքելական Եկեղեցու հոգևոր և վարչական կենտրոնն է։
//     Վաղարշապատն ունի գլխավոր ճանապարհ դեպի մայրաքաղաք Երևան։ Միացված է Երևանին գյուղերով։ Վաղարշապատից դեպի Երևան մայրուղին 15-16 կմ է։
//     1945 թվականին քաղաքը վերանվանվել է ${myEjmiatsin.cityNames[0].name1} և այդ անուն է կրել մինչև 1992 թվականը, երբ նորից վերանվանվեց Վաղարշապատ։
//     Հայաստանում քրիստոնեության պաշտոնական կրոն ճանաչվելուց հետո Վաղարշապատի դերը երկրի կյանքում առավել ևս մեծանում է, այն միաժամանակ դառնում է նաև հայոց հոգևոր կենտրոն։ Միջնաբերդում կառուցվում է Մայր տաճարը, իսկ Հոիփսիմյան կույսերի նահատակման վայրերում՝ նրանց նվիրված մատուռները։ 5-րդ դարի կեսերին՝ Մայր աթոոը Դվին փոխադրելուց հետո, փաստորեն մինչև 7-րդ դարը Վաղարշապատր կորցնում է իր երբեմնի նշանակաթյանը։ 7-րդ դարում պարսկա-բյուզանդական հակամարտությունների ոլորտում գտնվող Հայաստանում՝ ինքնավարության առկայության տասնամյակներին պայմաններ են ստեղծվում քաղաքի տնտեսության և մշակույթի վերելքի համար, քաղաքային կյանքը Վաղարշապատում կրկին աշխուժանում է 4-րդ դարում հիմնված մատուռների փոխարեն մեկը մյուսի ետևից կառուցվում են ${myEjmiatsin.churchs[1].church2} (618 թ.) ու ${myEjmiatsin.churchs[2].church3} (680 թ.) եկեղեցիները, վերանորոգվում է ${myEjmiatsin.churchs[0].church1}ը։ 15-րդ դարում Վաղարշապատում վերահաստատվում է կաթողիկոսարանը։ 13-15-րդ դարերից Վաղարշապատը դարձավ հայոց հոգևոր կենտրոնը, իսկ տաճարը՝ անկախ կաթողիկոսական աթոռանիստի տեղափոխություններից, պահպանեց մայր տաճարի առաջնային նշանակությունը։ 1828 թվականին Էջմիածինը Արևելյան Հայաստանի կազմում վերջնականապես միացվում է Ռուսաստանին։ Ռուսական կառավարությունը, նախկին իշխանությունների նման, նույնպես ճանաչում են միաբանության իրավունքներն Էջմիածնի վրա։ Չնայած 19-րդ դարի կեսից Էջմիածինը դառնում է Երևանի նահանգի Էջմիածնի վիճակի կենտրոնը, այնուամենայնիվ, բուն քաղաքը կառավարում էին կաթողիկոսարանն ու միաբանությունը՝ սինոդի հետ մեկտեղ։ Խորհրդային իշխանության առաջին օրերից Էջմիածինը դադարում է վանքապատկան լինելուց և դառնում Վաղարշապատի գավառի կենտրոնը։ Այժմ ${myEjmiatsin.churchs[0].church1} Մայր Տաճարը Ամենայն Հայոց կաթողիկոսների նստավայրն է։
//     ${myEjmiatsin.churchs[3].church4} եկեղեցի է Վաղարշապատի հյուսիսային կողմում, արքունի հնձանների տեղում՝ կառուցված՝ ըստ ավանդության, Հռիփսիմյանց կույսերից սուրբ Մարիանեի նահատակության վայրում, Աղամալ Սորոտեցի արքայազնի կողմից կաթողիկոս Նահապետ Ա Եդեսացի ժամանակներում։ Ընդգրկված է ՅՈւՆԵՍԿՕ-ի Համաշխարհային ժառանգության ցուցակում։
//     ${myEjmiatsin.churchs[4].church5} գտնվում է Էջմիածին քաղաքում՝ Մայր Տաճարից փոքր հեռավորության վրա։ Կառուցվել է 1767 թվականին Սիմեոն Երևանցի կաթողիկոսի օրոք։ Վազգեն Ա կաթողիկոսի օրոք՝ 1986 թվականին, վերանորոգվել է եկեղեցին և կառուցվել է զանգակատունը։
//     Համաձայն Մովսես Խորենացու «Հայոց պատմության», մինչև Վաղարշապատ կոչվելը քաղաքը անվանվել է ${myEjmiatsin.cityNames[1].name2}, իսկ դրանից առաջ ${myEjmiatsin.cityNames[2].name3}։

//         `;
//     }

// };
// console.log(myEjmiatsin.aboutEjmiatsin());


//26. ստեղծում եք ֆունկցիա, որը իր մեջ ստեղծում է մեքենաներ (արգումենտներով),
//որ ամեն կանչելուց կարողանաք այլ պարամետրեր տալ ու ստանալ տարբեր մեքենաներ

// function cars(car1, car2, car3) {
// return`${car1}, ${car2}, ${car3}`;
// }

// console.log(cars("BMW", "Mercedes", "Toyota" ));


//27. ստեղծում եք 2 զանգված, որտեղ առաջինում պետք է լինեն և բացասական և դրական թվեր,
// ու for loop-ի միջոցով զանգվածից հանեք դրական թվերը, 
// իսկ բացասականները դրեք 2րդ դատարկ զանգվածի մեջ

// let arr1 = [1, -3, 5, -8, 4, -9, 6, 2];
// let arr2 = [];
// for (let i = 0; i <= arr1.length; i++) {
//     if(arr1[i] < 0) {
//         arr2.push(arr1[i]);
//     }  
// } 

// console.log(arr2);
// console.log(arr1);

// let arr1 = [1, -3, 5, -8, 4, -9, 6, 2];
// let arr2 = [];
// let j = 0;
// for (let i = 0; i <= arr1.length; i++) {
//   if(arr1[i] < 0){
//     arr2[j] = arr1[i];
//     j++;
//   } 
// }
// console.log(arr2);


//28. ստեղծում եք օբյեկտ, որտեղ նկարագրում եք մարդու, որը ունի ընկերներ, ստատուսներ, սև ցուցակի մեջ մարդիկ, 
// լայքեր, էլ. հասցե, հեռախոս, գաղտնաբառ և այլն (նմանեցնել Ֆեյսբուքին)

// const person = {
//     personInpho: [
//                 {address: "Էջմիծին, Իսակով 10/1"},
//                 {telNumber: "093 65-54-45"},
//                 {mail: "karoyan-gevorg@mail.ru"},
//                 {facebook: "https://www.facebook.com/GevKaroyan/"}
//             ]
// };


// 29. ստեղծում եք զանգված, ու մեջը 10 հատ օբյեկտ, ամեն օբյեկտում ձեր նախընտրած մարդկանց մասին մի քանի ինֆորմացիա՝անուն
// ազգանուն, տարիք, մասնագիտություն ու ազգություն, 
// հետո loop-ի միջոցով էդ օբյետկտերի մարդկանց անունները տպում եք կոնսոլում

// const persons = [{
//     name: "Samvel",
//     lastname: "Hayrapetyan",
//     age: 29,
//     profession: "IT & Cyber Security Specialist",
//     Nationality: "armenian"
//   },
//   {
//     name: "Gagik",
//     lastname: "Karapetyan",
//     age: 30,
//     profession: "doctor",
//     Nationality: "armenian"

//   },
//   {
//     name: "Lusine",
//     lastname: "Stepanyan",
//     age: 30,
//     profession: "teacher",
//     Nationality: "armenian"
//   },
//   {
//     name: "Ani",
//     lastname: "Sargsyan",
//     age: 20,
//     profession: "student",
//     Nationality: "armenian"
//   },
//   {
//     name: "Astghik",
//     lastname: "Manukyan",
//     age: 25,
//     profession: "accountant",
//     Nationality: "armenian"
//   },
//   {
//     name: "Armen",
//     lastname: "Galstyan",
//     age: 45,
//     profession: "driver",
//     Nationality: "armenian"
//   },
//   {
//     name: "Arman",
//     lastname: "Grigoryan",
//     age: 40,
//     profession: "master",
//     Nationality: "armenian"
//   },
//   {
//     name: "Artur",
//     lastname: "Aleksanyan",
//     age: 30,
//     profession: "sportsman",
//     Nationality: "armenian"
//   },
//   {
//     name: "Iveta",
//     lastname: "Mukuchyan",
//     age: 35,
//     profession: "singer",
//     Nationality: "armenian"
//   },
// ];

// for (let i = 0; i < persons.length; i++) {
//   console.log(persons[i]);
// }
 

